n-miyamoto/PIC24FJ64GB002_serial_bootloader/PIC24_serial_bootloader.X/boot.c
/*
 * File:   boot.c
 * Author: NAOYA
 *
 * Created on 2017/04/09, 22:43
 */


//Includes *******************************
#include "config.h"
#include <stdio.h>
#include "uart.h"
#include "delay.h"

#ifdef __XC16
#include <xc.h>
#endif

//****************************************


//Globals ********************************
WORD responseBytes;		//number of bytes in command response
DWORD_VAL sourceAddr;	//general purpose address variable
DWORD_VAL userReset;	//user code reset vector
DWORD_VAL userTimeout; 	//bootloader entry timeout value
WORD userResetRead;		//bool - for relocating user reset vector

//Variables for storing runaway code protection keys
#ifdef USE_RUNAWAY_PROTECT
volatile WORD writeKey1 = 0xFFFF;
volatile WORD writeKey2 = 0x5555;
volatile WORD keyTest1 = 0x0000;
volatile WORD keyTest2 = 0xAAAA;
#endif

//Transmit/Recieve Buffer
BYTE buffer[MAX_PACKET_SIZE+1];
//****************************************

//Configuration bits *********************
/*
*	These configuration settings are not required for proper 
*	bootloader operation and can be modified as desired.  
*
*	Refer to AN1157 troubleshooting for configuration suggestions
*/


#define DEV_HAS_USB

#ifndef DEV_HAS_CONFIG_BITS
    #ifdef DEV_HAS_USB
    //_CONFIG1(JTAGEN_OFF & GWRP_OFF & ICS_PGx1 & FWDTEN_OFF)
    //_CONFIG2(POSCMOD_HS & FNOSC_PRIPLL & PLLDIV_DIV2 & PLL96MHZ_ON)
    _CONFIG1( JTAGEN_OFF & GCP_OFF & GWRP_OFF & ICS_PGx1 & FWDTEN_OFF )
    _CONFIG2( IESO_ON & FNOSC_FRCPLL & FCKSM_CSDCMD & OSCIOFNC_ON &
	IOL1WAY_OFF & I2C1SEL_PRI & POSCMOD_NONE  & PLL96MHZ_ON & PLLDIV_DIV2 )
	_CONFIG4(RTCOSC_SOSC)
    #else
    _CONFIG1(JTAGEN_OFF & GWRP_OFF & ICS_PGx2 & FWDTEN_OFF)
    _CONFIG2(POSCMOD_HS & FNOSC_PRIPLL)
    #endif
#else
    _FOSCSEL(FNOSC_PRIPLL)
    _FOSC(POSCFREQ_MS & POSCMOD_XT)
    _FWDT(FWDTEN_OFF)
    _FICD(ICS_PGx3)
#endif
//****************************************


/********************************************************************
* Function: 	int main()
*
* Precondition: None.
*
* Input: 		None.
*
* Output:		None.
*
* Side Effects:	Enables 32-bit Timer2/3.  Enables UART.
*
* Overview: 	Initialization of program and main loop.
*			
* Note:		 	None.
********************************************************************/
    
void SYSTEM_Initialize (void)
{
#if defined(unix) || defined(__APPLE__) || defined(_WIN32)
#else
	AD1PCFG = 0xFFFC; //Never use AD converter
	
#ifdef PCB1
	TRISAbits.TRISA0 = 1;   //AN0  P2: set to Input for analog in
	TRISAbits.TRISA1 = 1;   //AN1  P3: set to Input for analog in
#endif

	TRISBbits.TRISB0 = 1;   //State of wireless module
	TRISBbits.TRISB1 = 0;   //RESET pin of wireless module.
	LATBbits.LATB1 = 1;     //wake_sw : active
	TRISAbits.TRISA2 = 0;   //9:wake_up pin of wireless module
	LATAbits.LATA2 = 1;     

	TRISBbits.TRISB2 = 1;   //P6: set to Input  for UART1 Rx
	TRISBbits.TRISB3 = 0;   //P7: set to Output for UART1 Tx

	TRISBbits.TRISB15 = 1;   //P15: set to Output for UART2 Rx
	TRISBbits.TRISB14 = 0;   //P14: set to Input  for UART2 Tx

	TRISAbits.TRISA3 = 0;   //P10: set to Output for high side switch
	LATAbits.LATA3 = 0;     //turn off high side switch

	TRISBbits.TRISB5 = 0;   //P14: wake_measurement module
	LATBbits.LATB5 = 1;     //

	TRISBbits.TRISB13 = 1;   //P24: set to Input for analog in

	TRISBbits.TRISB11 = 1;
	TRISBbits.TRISB10 = 0;
	
	TRISBbits.TRISB13 = 0;  //Set status LED
	LATBbits.LATB13 = 0;    //Turn off status LED

	TRISBbits.TRISB7 = 0;   //set 
	RPINR20bits.SDI1R = 11; // SDI??RP7??
	RPOR5bits.RP10R = 8;    // SCK1??RP2??
	RPOR3bits.RP7R = 7;     // SDO1??RP3??
#endif 
}
        
void init_uart(void){
    RPINR18bits.U1RXR = 2;  //rx UART1 RP2
	RPOR1bits.RP3R = 3;     //tx UART1
	CloseUART1();

	unsigned int config1 =  UART_EN &               // UART enable
							UART_IDLE_CON &         // operete in Idle mode
							UART_DIS_WAKE &         // Don't wake up in sleep mode
							UART_IrDA_DISABLE &
							UART_DIS_LOOPBACK &     // don't loop back
							UART_NO_PAR_8BIT &      // No parity bit, 8bit
							UART_1STOPBIT &         //Stop bit
							UART_MODE_SIMPLEX  &    //no flow control
							UART_UEN_00 &
							UART_UXRX_IDLE_ONE &    // U1RX idle 1
							UART_BRGH_SIXTEEN &     // invalid high speed transport
							UART_DIS_ABAUD;         // disable audo baud

	unsigned int config2 =  UART_INT_TX_BUF_EMPTY &  // TXD interrupt on
							UART_IrDA_POL_INV_ZERO & // U1TX idle clear
							UART_TX_ENABLE &         // Enable TXD
							UART_INT_RX_CHAR &       // RXD interrupt on
							UART_ADR_DETECT_DIS &
							UART_RX_OVERRUN_CLEAR;


	OpenUART1(config1, config2,8 );
	ConfigIntUART1( UART_RX_INT_EN & UART_TX_INT_DIS );
	IEC0bits.U1RXIE = 0; //disable interrupt
}
    
//#define DEBUG
int main()
{
    CLKDIV = 0;
    SYSTEM_Initialize();
    init_uart();
    
#ifdef DEBUG
    delay_ms(3);
    printf("hello");
    printf("\r\n\r\n\r\n");
#endif

    //////////////////////////////////
        
	DWORD_VAL delay;

	//Setup bootloader entry delay
	sourceAddr.Val = DELAY_TIME_ADDR;	//bootloader timer address
	delay.Val = ReadLatch(sourceAddr.word.HW, sourceAddr.word.LW); //read BL timeout
	
	//Setup user reset vector
	sourceAddr.Val = USER_PROG_RESET;
	userReset.Val = ReadLatch(sourceAddr.word.HW, sourceAddr.word.LW);

	//Prevent bootloader lockout - if no user reset vector, reset to BL start
	if(userReset.Val == 0xFFFFFF){
		userReset.Val = BOOT_ADDR_LOW;	
	}
	userResetRead = 0;
    
#ifdef DEBUG
    printf("delay_val: %ld \r\nuser_reset: %ld \r\n",delay.Val,userReset.Val);
#endif 
    

	//If timeout is zero, check reset state.
	if(delay.v[0] == 0){

		//If device is returning from reset, BL is disabled call user code
		//otherwise assume the BL was called from use code and enter BL
		if(RCON & 0xFED3){
			//If bootloader disabled, go to user code
			ResetDevice(userReset.Val);         //goto 
		}else{
			delay.Val = 0xFF;
		}
	}


	T2CONbits.TON = 0;
	T2CONbits.T32 = 1; // Setup Timer 2/3 as 32 bit timer incrementing every clock
	IFS0bits.T3IF = 0; // Clear the Timer3 Interrupt Flag 
	IEC0bits.T3IE = 0; // Disable Timer3 Interrupt Service Routine 

	//Enable timer if not in always-BL mode
	if((delay.Val & 0x000000FF) != 0xFF){
		//Convert seconds into timer count value 
		delay.Val = ((DWORD)(FCY)) * ((DWORD)(delay.v[0])); 

		PR3 = delay.word.HW; //setup timer timeout value
		PR2 = delay.word.LW;

		TMR2 = 0;
		TMR3 = 0;
		T2CONbits.TON=1;  //enable timer
	}


